color_dict = {
    "white": (255, 255, 255),
    "green": (0, 255, 0),
    "blue": (0, 0, 128),
    "red": (255, 0, 0),
    "yellow": (255, 255, 0),
    "orange": (255, 165, 0),
    "purple": (128, 0, 128),
    "pink": (255, 182, 193),
    "brown": (165, 42, 42),
    "gray": (128, 128, 128),
    "black": (0, 0, 0),
    "cyan": (0, 255, 255),
    "magenta": (255, 0, 255),
    "lime": (0, 255, 0),
    "teal": (0, 128, 128),
    "navy": (0, 0, 128),
    # Add more colors as needed
}


pofomopo_consonants = ["ㄅ (b)", "ㄆ (p)", "ㄇ (m)", "ㄈ (f)", "ㄉ (d)", "ㄊ (t)", "ㄋ (n)", "ㄌ (l)", "ㄍ (g)", "ㄎ (k)", "ㄏ (h)", "ㄐ (j)", "ㄑ (q)", "ㄒ (x)", "ㄓ (zh)", "ㄔ (ch)", "ㄕ (sh)", "ㄖ (r)", "ㄗ (z)", "ㄘ (c)", "ㄙ (s)"]

similarity_list = [1, 2, 3, 4, 5]
